cmsis-svd/cmsis-svd/data/STMicro/STM32WB55.svd
            <register>
               <name>SYSCFG_SWPR2</name>
               <displayName>SYSCFG_SWPR2</displayName>
               <description>SRAM2 write protection register           2</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>P63WP</name>
                     <description>SRAM2 page 63 write               protection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P62WP</name>
                     <description>P62WP</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P61WP</name>
                     <description>P61WP</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P60WP</name>
                     <description>P60WP</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P59WP</name>
                     <description>P59WP</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P58WP</name>
                     <description>P58WP</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P57WP</name>
                     <description>P57WP</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P56WP</name>
                     <description>P56WP</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P55WP</name>
                     <description>P55WP</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P54WP</name>
                     <description>P54WP</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P53WP</name>
                     <description>P53WP</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P52WP</name>
                     <description>P52WP</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P51WP</name>
                     <description>P51WP</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P50WP</name>
                     <description>P50WP</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P49WP</name>
                     <description>P49WP</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P48WP</name>
                     <description>P48WP</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P47WP</name>
                     <description>P47WP</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P46WP</name>
                     <description>P46WP</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P45WP</name>
                     <description>P45WP</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P44WP</name>
                     <description>P44WP</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P43WP</name>
                     <description>P43WP</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P42WP</name>
                     <description>P42WP</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P41WP</name>
                     <description>P41WP</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P40WP</name>
                     <description>P40WP</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P39WP</name>
                     <description>P39WP</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P38WP</name>
                     <description>P38WP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P37WP</name>
                     <description>P37WP</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P36WP</name>
                     <description>P36WP</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P35WP</name>
                     <description>P35WP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P34WP</name>
                     <description>P34WP</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P33WP</name>
                     <description>P33WP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P32WP</name>
                     <description>P32WP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
			<register>
               <name>VREFBUF_CSR</name>
               <displayName>VREFBUF_CSR</displayName>
               <description>VREF control and status           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>ENVR</name>
                     <description>Voltage reference buffer               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HIZ</name>
                     <description>High impedance mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VRS</name>
                     <description>Voltage reference scale</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VRR</name>
                     <description>Voltage reference buffer               ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>VREFBUF_CCR</name>
               <displayName>VREFBUF_CCR</displayName>
               <description>calibration control register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRIM</name>
                     <description>Trimming code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSCFG_IMR1</name>
               <displayName>SYSCFG_IMR1</displayName>
               <description>CPU1 interrupt mask register 1</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIM1IM</name>
                     <description>Peripheral TIM1 interrupt mask to               CPU1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16IM</name>
                     <description>Peripheral TIM16 interrupt mask to               CPU1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM17IM</name>
                     <description>Peripheral TIM17 interrupt mask to               CPU1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT5IM</name>
                     <description>Peripheral EXIT5 interrupt mask to               CPU1</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT6IM</name>
                     <description>Peripheral EXIT6 interrupt mask to               CPU1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT7IM</name>
                     <description>Peripheral EXIT7 interrupt mask to               CPU1</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT8IM</name>
                     <description>Peripheral EXIT8 interrupt mask to               CPU1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT9IM</name>
                     <description>Peripheral EXIT9 interrupt mask to               CPU1</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT10IM</name>
                     <description>Peripheral EXIT10 interrupt mask to               CPU1</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT11IM</name>
                     <description>Peripheral EXIT11 interrupt mask to               CPU1</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT12IM</name>
                     <description>Peripheral EXIT12 interrupt mask to               CPU1</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT13IM</name>
                     <description>Peripheral EXIT13 interrupt mask to               CPU1</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT14IM</name>
                     <description>Peripheral EXIT14 interrupt mask to               CPU1</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXIT15IM</name>
                     <description>Peripheral EXIT15 interrupt mask to               CPU1</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSCFG_IMR2</name>
               <displayName>SYSCFG_IMR2</displayName>
               <description>CPU1 interrupt mask register 2</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PVM3IM</name>
                     <description>Peripheral PVM3 interrupt mask to               CPU1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVM1IM</name>
                     <description>Peripheral PVM1 interrupt mask to               CPU1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVDIM</name>
                     <description>Peripheral PVD interrupt mask to               CPU1</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSCFG_C2IMR1</name>
               <displayName>SYSCFG_C2IMR1</displayName>
               <description>CPU2 interrupt mask register 1</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCSTAMP</name>
                     <description>Peripheral RTCSTAMP interrupt mask to               CPU2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCWKUP</name>
                     <description>Peripheral RTCWKUP interrupt mask to               CPU2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCALARM</name>
                     <description>Peripheral RTCALARM interrupt mask to               CPU2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCC</name>
                     <description>Peripheral RCC interrupt mask to               CPU2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLASH</name>
                     <description>Peripheral FLASH interrupt mask to               CPU2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKA</name>
                     <description>Peripheral PKA interrupt mask to               CPU2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNG</name>
                     <description>Peripheral RNG interrupt mask to               CPU2</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES1</name>
                     <description>Peripheral AES1 interrupt mask to               CPU2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMP</name>
                     <description>Peripheral COMP interrupt mask to               CPU2</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC</name>
                     <description>Peripheral ADC interrupt mask to               CPU2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
