cmsis-svd/cmsis-svd/data/STMicro/STM32WB55.svd
            <register>
               <name>SYSCFG_C2IMR2</name>
               <displayName>SYSCFG_C2IMR2</displayName>
               <description>CPU2 interrupt mask register 1</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA1_CH1_IM</name>
                     <description>Peripheral DMA1 CH1 interrupt mask to               CPU2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1_CH2_IM</name>
                     <description>Peripheral DMA1 CH2 interrupt mask to               CPU2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1_CH3_IM</name>
                     <description>Peripheral DMA1 CH3 interrupt mask to               CPU2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1_CH4_IM</name>
                     <description>Peripheral DMA1 CH4 interrupt mask to               CPU2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1_CH5_IM</name>
                     <description>Peripheral DMA1 CH5 interrupt mask to               CPU2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1_CH6_IM</name>
                     <description>Peripheral DMA1 CH6 interrupt mask to               CPU2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1_CH7_IM</name>
                     <description>Peripheral DMA1 CH7 interrupt mask to               CPU2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2_CH1_IM</name>
                     <description>Peripheral DMA2 CH1 interrupt mask to               CPU1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2_CH2_IM</name>
                     <description>Peripheral DMA2 CH2 interrupt mask to               CPU1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2_CH3_IM</name>
                     <description>Peripheral DMA2 CH3 interrupt mask to               CPU1</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2_CH4_IM</name>
                     <description>Peripheral DMA2 CH4 interrupt mask to               CPU1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2_CH5_IM</name>
                     <description>Peripheral DMA2 CH5 interrupt mask to               CPU1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2_CH6_IM</name>
                     <description>Peripheral DMA2 CH6 interrupt mask to               CPU1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2_CH7_IM</name>
                     <description>Peripheral DMA2 CH7 interrupt mask to               CPU1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAM_UX1_IM</name>
                     <description>Peripheral DMAM UX1 interrupt mask to               CPU1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVM1IM</name>
                     <description>Peripheral PVM1IM interrupt mask to               CPU1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVM3IM</name>
                     <description>Peripheral PVM3IM interrupt mask to               CPU1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVDIM</name>
                     <description>Peripheral PVDIM interrupt mask to               CPU1</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSCIM</name>
                     <description>Peripheral TSCIM interrupt mask to               CPU1</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDIM</name>
                     <description>Peripheral LCDIM interrupt mask to               CPU1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSCFG_SIPCR</name>
               <displayName>SYSCFG_SIPCR</displayName>
               <description>secure IP control register</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SAES1</name>
                     <description>Enable AES1 KEY[7:0]               security.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAES2</name>
                     <description>Enable AES2 security.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPKA</name>
                     <description>Enable PKA security</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRNG</name>
                     <description>Enable True RNG security</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
